{
  "filename": "containerd_accepted_nydus-snapshotter.md",
  "__html": "<h1>Containerd Accepted Nydus-snapshotter</h1>\n<p>Early January, Containerd community has taken in nydus-snapshotter as a sub-project. Check out the code, particular introductions and tutorial from its <a href=\"https://github.com/containerd/nydus-snapshotter\">new repository</a>. We believe that the donation to containerd will attract more users and developers for nydus itself and bring much value to the community users.</p>\n<p>Nydus-snapshotter is a containerd's remote snapshotter, it works as a standalone process out of containerd, which only pulls nydus image's bootstrap from remote registry and forks another process called <strong>nydusd</strong>. Nydusd has a unified architecture, which means it works in form of a FUSE user-space filesystem daemon, a virtio-fs daemon or a fscache user-space daemon. Nydusd is responsible for fetching data blocks from remote storage like object storage or standard image registry, thus to fulfill containers' requests to read its rootfs.</p>\n<p>Nydus is an excellent container image acceleration solution which significantly reduces time cost by starting container. It is originally developed by a virtual team from Alibaba Cloud and Ant Group and deployed in very large scale. Millions of containers are created based on nydus image each day in Alibaba Cloud and Ant Group. The underlying technique is a newly designed, container optimized and oriented read-only filesystem named <strong>Rafs</strong>. Several approaches are provided to create rafs format container image.\nThe image can be pushed and stored in standard registry since it is compatible with OCI image and distribution specifications. A nydus image can be converted from a OCI source image where metadata and files data are split into a &quot;bootstrap&quot; and one or more &quot;blobs&quot; together with necessary manifest.json and config.json. Development of integration with Buildkit is in progress.</p>\n<p>​<img src=\"../img/nydus/rafs_disk_layout.png\" alt=\"rafs disk layout\"></p>\n<p>Nydus provides following key features:</p>\n<ul>\n<li>Chunk level data de-duplication among layers in a single repository to reduce storage, transport and memory cost</li>\n<li>Deleted(whiteout) files in certain layer aren't packed into nydus image, therefore, image size may be reduced</li>\n<li>E2E image data integrity check. So security issues like &quot;Supply Chain Attack&quot; can be avoided and detected at runtime</li>\n<li>Integrated with CNCF incubating project Dragonfly to distribute container images in P2P fashion and mitigate the pressure on container registries</li>\n<li>Different container image storage backends are supported. For example, Registry, NAS, Aliyun/OSS and applying other remote storage backend like AWS S3 is also possible.</li>\n<li>Record files access pattern during runtime gathering access trace/log, by which user's abnormal behaviors are easily caught. So we can ensure the image can be trusted</li>\n</ul>\n<p>Beyond above essential features, nydus can be flexibly configured as a FUSE-base user-space filesystem or in-kernel EROFS with an on-demand loader user-space daemon and integrating nydus with VM-based container runtime is much easier.</p>\n<ul>\n<li>Lightweight integration with VM-based containers runtime like KataContainers. In fact, KataContainers is considering supporting nydus as a <strong>native</strong> image acceleration solution.</li>\n<li>Nydus closely cooperates with Linux <strong>in-kernel</strong> disk filesystem Containers' rootfs can directly be set up by EROFS with lazy pulling capability. The corresponding changes had been merged into Linux kernel since v5.16</li>\n</ul>\n<p>To run with runc, nydusd works as FUSE user-space daemon:</p>\n<p><img src=\"../img/nydus/nydus_runc.png\" alt=\"runc nydus\"></p>\n<p>To work with KataContainers, it works as a virtio-fs daemon:</p>\n<p><img src=\"../img/nydus/nydus_kata.png\" alt=\"kata nydus\"></p>\n<p>Nydus community is working together with Linux Kernel to develop erofs+fscache based user-space on-demand read.</p>\n<p><img src=\"../img/nydus/nydus_runc_erofs.svg\" alt=\"runc erofs nydus\"></p>\n<p>Nydus and eStargz developers are working together on a new project named <a href=\"https://github.com/goharbor/acceleration-service\">acceld</a> in <strong>Harbor</strong> community to provide a general service to support the conversion from OCI v1 image to kinds of acceleration image formats for various accelerator providers, so that keep a smooth upgrade from OCI v1 image. In addition to the conversion service acceld and the conversion tool nydusify, nydus is also supporting buildkit to enable exporting nydus image directly from Dockerfile as a compression type.</p>\n<p>In the future, nydus community will work closely with the containerd community on fast and efficient methods and solution of distributing container images, container image security, container image content storage efficiency, etc.</p>\n",
  "link": "/en-us/blog/containerd_accepted_nydus-snapshotter.html",
  "meta": {
    "hidden": "false",
    "title": "Containerd Accepted Nydus-snapshotter",
    "keywords": "dragonfly, container image, OCI, nydus, nydus-snapshotter, containerd",
    "description": "Announcing Containerd accepted nydus-snapshotter as a sub-project",
    "author": "Changwei Ge",
    "date": "2022-01-17"
  }
}