{
  "filename": "faq.md",
  "__html": "<h1>Frequently Asked Questions (FAQ)</h1>\n<p>FAQ contains the frequently asked questions about two aspects:</p>\n<ul>\n<li>First, user-facing functionalities.</li>\n<li>Second, underlying concept and thoery.</li>\n</ul>\n<p>Techinical question will not be included in FAQ.</p>\n<h2>What is Dragonfly</h2>\n<p><strong>Dragonfly is an intelligent P2P based image and file distribution system.</strong></p>\n<p>It aims to resolve issues related to low-efficiency, low-success rate and waste of network bandwidth in file transferring process. Especially in large-scale file distribution scenarios such as application distribution, cache distribution, log distribution, image distribution, etc.</p>\n<p>In Alibaba, Dragonfly is invoked 2 Billion times and the data distributed is 3.4PB every month. Dragonfly has become one of the most important pieces of infrastructure at Alibaba.</p>\n<p>While container technologies makes devops life easier most of the time, it sure brings a some challenges: the efficiency of image distribution, especially when you have to replicate image distribution on several hosts. Dragonfly works extremely well with both Docker and <a href=\"https://github.com/alibaba/pouch\">PouchContainer</a> for this scenario. It also is compatible with any other container formats.</p>\n<p>It delivers up to 57 times the throughput of native docker and saves up to 99.5% the out bandwidth of registry(*2).</p>\n<p>Dragonfly makes it simple and cost-effective to set up, operate, and scale any kind of files/images/data distribution.</p>\n<h2>Is Dragonfly only designed for distribute container images</h2>\n<p>No, Dragonfly can be used to distribute all kinds of files, not only container images. For downloading files by Dragonfly, please refer to <a href=\"https://github.com/dragonflyoss/Dragonfly/blob/master/docs/quick_start/README.md#downloading-a-file-with-dragonfly\">Download a File</a>. For pulling images by Dragonfly, please refer to <a href=\"https://github.com/dragonflyoss/Dragonfly/blob/master/docs/quick_start/README.md#pulling-an-image-with-dragonfly\">Pull an Image</a>.</p>\n<h2>What is the sequence of P2P distribution</h2>\n<p>Supernode will maintain a bitmap which records the correspondence between peers and pieces. When dfget starts to download, supernode will return several pieces info (4 by default）according to the scheduler.</p>\n<p><strong>NOTE</strong>: The scheduler will decide whether to download from the supernode or other peers. As for the details of the scheduler, please refer to <a href=\"#what-is-the-peer-scheduling-algorithm-by-default\">scheduler algorithm</a></p>\n<h2>How do supernode and peers manage file cache which is ready for other peer's pulling</h2>\n<p>Supernode will download files and cache them via CDN. For more information, please refer to <a href=\"#what-is-the-sequence-of-supernode's-cdn-functionality\">The sequence of supernode's CDN functionality</a>.</p>\n<p>After finishing distributing file from other peers, <code>dfget</code> should do two kinds of thing:</p>\n<ul>\n<li>first, construct all the pieces into unioned file(s);</li>\n<li>second, backup the unioned file(s) in configured directory, by default &quot;$HOME/.small-dragonfly/data&quot; with a suffix of &quot;.server&quot;;</li>\n<li>third, move the original unioned file(s) to the destination path.</li>\n</ul>\n<p><strong>NOTE</strong>: The supernode cannot manage the cached file which is already distributed to peer node at all. For that what will happen if the cached file on a peer is deleted, please refer to <a href=\"#what-if-you-kill-the-dfget-server-process-or-delete-the-source-files\">What if you kill the dfget server process or delete the source files</a></p>\n<h2>What is the sequence of supernode's CDN functionality</h2>\n<p>When dfget register a task to supernode, supernode will check whether the file to be downloaded has a cache locally.</p>\n<p>If the file to be downloaded which has not been cached in supernode yet, supernode will do as the following sequence:</p>\n<ul>\n<li>First Step: supernode triggers the downloading task asynchronously:\n<ul>\n<li>fetch the file/image length;</li>\n<li>divide the length into pieces;</li>\n<li>start to download the file piece by piece and store it locally;</li>\n</ul>\n</li>\n<li>Second Step:\n<ul>\n<li>supernode finishes to download one piece</li>\n<li>supernode starts the P2P distribution work for the downloaded one piece among peers;</li>\n</ul>\n</li>\n</ul>\n<p>If the requested file which has already been cached in supernode, supernode will send an HTTP GET request, which contains both HTTP headers <code>If-None-Match:&lt;eTag&gt;</code> and <code>If-Modified-Since:&lt;lastModified&gt;</code>, to source file network address to determine whether the remote file has been updated.</p>\n<p>In addition, supernode does not have to wait for all the piece downloadings finished, so it can concurrently start piece downloading once one piece downloaded.</p>\n<h2>What if you kill the dfget server process or delete the source files</h2>\n<p>If a file on the peer is deleted manually or by GC, the supernode won't know that. And in the subsequent scheduling, if multiple download tasks fail from this peer, the scheduler will add it to blacklist. So do with that if the server process be killed or other abnormal conditions.</p>\n<h2>What is the peer scheduling algorithm by default</h2>\n<ul>\n<li>\n<p>Distribute the number of pieces evenly. Select the piece with the smallest number in the entire P2P network so that the distribution of each piece in the P2P network is balanced to avoid &quot;Nervous resources&quot;.</p>\n</li>\n<li>\n<p>Nearest distance priority. For a peer, the piece closest to the piece currently being downloaded is preferentially selected, so that the peer can achieve the effect of sequential read and write approximately which will improve the I/O efficiency of file.</p>\n</li>\n<li>\n<p>Local blacklist and global blacklist. An example is easier to understand: When peer A fails to download from peer B, B will become the local blacklist of A, and then the download tasks of A will filter B out; When the number of failed downloads from B reaches a certain threshold, B will become the global blacklist, and all the download tasks will filter B out.</p>\n</li>\n<li>\n<p>Self-isolation. PeerA will only download files from the supernode after it fails to download multiple times from other peers, and will also be added to the global blacklist. So the peer A will no longer interact with peers other than the supernode.</p>\n</li>\n<li>\n<p>Peer load balancing. This mechanism will control the number of upload pieces and download pieces that each peer can provide simultaneously and the priority as the target peer.</p>\n</li>\n</ul>\n<h2>What is the size of block(piece) when distribution</h2>\n<p>Dragonfly tries to make block(piece) size dynamically to ensure efficiency.</p>\n<p>The size of pieces which is calculated as per the following strategy:</p>\n<ul>\n<li>If file's total size is less than 200MB, then the piece size is <code>4MB</code> by default.</li>\n<li>Otherwise, it equals to <code>min{ totalSize/100MB + 2 MB, 15MB }</code>.</li>\n</ul>\n<h2>What is the difference between Dragonfly's P2P algorithm and bit-torrent(BT)</h2>\n<p>Dragonfly's P2P algorithm and bit-torrent(BT) are both the implementation of peer-to-peer protocol. For the difference between them, we describe them in the following table:</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:center\">Aspect</th>\n<th style=\"text-align:center\">Dragonfly</th>\n<th style=\"text-align:center\">Bit-Torrent(BT)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center\">seed's dynamically compress</td>\n<td style=\"text-align:center\">support</td>\n<td style=\"text-align:center\">no support</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">resume from break-point</td>\n<td style=\"text-align:center\">support</td>\n<td style=\"text-align:center\">no support</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">dynamically block size setting</td>\n<td style=\"text-align:center\">support, see <a href=\"#what-is-the-size-of-blockpiece-when-distribution\">question</a></td>\n<td style=\"text-align:center\">no support(block size is fixed)</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">transparent of seed to client</td>\n<td style=\"text-align:center\">support(user only needs to provide URL of file)</td>\n<td style=\"text-align:center\">no support(BT needs to generate seed in tracker first, and then provide it to client)</td>\n</tr>\n</tbody>\n</table>\n<h2>What is the policy of bandwidth limit in peer network</h2>\n<p>We can enforce network bandwidth limit on both peer nodes and supernode of Dragonfly cluster.</p>\n<p>For peer node itself, Dragonfly can set network bandwidth limit for two parts:</p>\n<ul>\n<li>one single downloading task; by default, limit is 10MB/s per downloading task. User can set task network bandwidth limit by parameter <code>--locallimit</code> within <code>dfget</code>.</li>\n<li>the whole network bandwidth consumed by P2P distribution on the peer node. This can be configured via parameter <code>totallimit</code> within <code>dfget</code>. If user has set <code>--totallimit=40M</code>, then both TX and RX limit are 40 MB/s.</li>\n</ul>\n<p>For supernode, Dragonfly allows user to limit both the input and output network bandwidth.</p>\n<p>You can also config it with config files, refer to <a href=\"./docs/cli_reference/dfget.md#etcdragonflyconf\">link</a>.</p>\n<h2>Why does dfget still keep running after file/image distribution finished</h2>\n<p>In a P2P network, a peer not only plays a role of downloader, but also plays a role of uploader.</p>\n<ul>\n<li>For downloader, peer needs to download block/piece of the file/image from other peers (supernode is one special peer as well);</li>\n<li>For uploader, peer needs to provide block/piece downloading service for other peers. At this time, other peers downloads block/piece from this peer, and this peer can be treated as an uploader.</li>\n</ul>\n<p>Back to question, when a peer finishes to download file/image, while there may be other peers which is still downloading block/piece from this peer. Then this dfget process still exist for the potential uploading service.</p>\n<p>Only when there is no new task to download file/images or no other peers coming to download block/piece from this peer, the dfget process will terminate.</p>\n<h2>Do I have to change my container engine configuration to support Dragonfly</h2>\n<p>Currently Dragonfly supports almost all kinds of container engines, such as Docker, <a href=\"https://github.com/alibaba/pouch\">PouchContainer</a>. When using Dragonfly, only one part of container engine's configuration needs update. It is the <code>registry-mirrors</code> configuration. This configuration update aims at making image pulling requests, which does not contain a third-party non-dockerhub registry address, from container engine will all be sent to <code>dfdaemon</code> process locally. And dfget does the request translation thing and proxies it to <code>dfget</code> locally.</p>\n<p>Configure container engine's <code>registry-mirrors</code> is quite easy. We take docker as an example. Administrator should modify configuration file of docker <code>/etc/docker/daemon.json</code> to add the following item:</p>\n<pre><code class=\"language-yml\"><span class=\"hljs-attr\">\"registry-mirrors\":</span> <span class=\"hljs-string\">[\"http://127.0.0.1:65001\"]</span>\n</code></pre>\n<p>With updating the configuration, request <code>docker pull mysql:5.6</code> will be sent to dfdaemon, while request <code>docker pull a.b.com/mysql:5.6</code> will not be sent to dfdaemon. Because docker engine only deals official images from docker hub to take advantages of registry mirror. However, if you set <code>--registry a.b.com</code> in dfdaemon, and send a request <code>docker pull mysql:5.6</code>, dfdaemon will proxy the request and distribute image <code>mysql:5.6</code> from registry <code>a.b.com</code>.</p>\n<blockquote>\n<p>Note: please remember restarting container engine after updating configuration.</p>\n</blockquote>\n<h2>Can I set dfdaemon as HTTP_PROXY?</h2>\n<p>Yes, please refer to the <a href=\"./docs/user_guide/proxy.md\">proxy guide</a>.</p>\n<h2>Do we support HA of supernode in Dragonfly</h2>\n<p>Currently no. In the later release, we will try to realise the HA of Dragonfly.</p>\n<p>In fact, you can <a href=\"#how-to-config-supernodes-for-dfget\">provide multiple supernodes for dfget</a> as an alternative. When a peer started to download a task, it will register to one of the supernode list randomly. And when the supernode suffers failure, the task being downloaded on it will automatically migrate to the other supdernodes in the supernode list.</p>\n<h2>How to config supernodes for dfget</h2>\n<p>There are two ways to config one or multiple supernodes for dfget</p>\n<ul>\n<li>config with config file</li>\n</ul>\n<pre><code class=\"language-shell\">cat &lt;&lt;EOD &gt; /etc/dragonfly/dfget.yml\nnodes:\n    - supernode01\n    - supernode02\n    - supernode03\nEOD\n</code></pre>\n<ul>\n<li>config with cli</li>\n</ul>\n<pre><code class=\"language-shell\">dfget --node supernode01 --node supernode02 --node supernode03\n\nor\n\ndfget --node supernode01,supernode02,supernode03\n</code></pre>\n<p>NOTE: If you use dfdaemon to call dfget, you can also pass this parameter to dfget via <code>dfdaemon --node</code>.</p>\n<h2>How to use Dragonfly in Kubernetes</h2>\n<p>It is very easy to deloy Dragonfly in Kubernetes with <a href=\"https://github.com/helm/helm\">Helm</a>. For more information of Dragonfly's Helm Chart, please refer to project <a href=\"https://github.com/dragonflyoss/helm-chart\">dragonflyoss/helm-chart</a>.</p>\n<h2>Can an image from a third-party registry be pulled via Dragonfly</h2>\n<p>We <strong>CANNOT</strong> pull an image from a third-party registry via Dragonfly. Images from third-party registry means that the name of image has no registry address, for example, image <code>a.b.com/admin/mysql:5.6</code> is a third-party image, and it is from registry <code>a.b.com</code>. To the opposite, <code>admin/mysql:5.6</code> is not from third-party registry, because name of the image does not contain a registry address.</p>\n<p>Because administrator needs to configure <code>--registry-mirrors=[&quot;http://127.0.0.1:65001&quot;]</code> for container engine to proxy part of image pulling requests to <code>dfdaemon</code> which listens on 65001 locally, images not from a third-part registry will use this registry mirror. However, when user pulls image <code>a.b.com/admin/mysql:5.6</code> which contains a third-party registry address, the container engine will directly access the third-party registry to pull the image, ignoring the configured registry mirror. Then It has nothing to do with the <code>dfdaemon</code> within Dragonfly.</p>\n<h2>Where is the log directory of Dragonfly client dfget</h2>\n<p>Log is very important for debugging or tracing. <code>dfget</code>'s log directory is <code>$HOME/.small-dragonfly/logs/dfclient.log</code>.</p>\n<h2>Where is the data directory of Dragonfly client dfget</h2>\n<p>The meta data directory of <code>dfget</code> is <code>$HOME/.small-dragonfly/meta</code>.</p>\n<p>This directory caches the address list of the local node (IP, hostname, IDC, security domain, and so on), managing nodes, and supernodes.</p>\n<p>When started for the first time, the Dragonfly client will access the managing node. The managing node will retrieve the security domains, IDC, geo-location, and more information of this node by querying armory, and assign the most suitable supernode. The managing node also distributes the address lists of all other supernodes. dfget stores the above information in the meta directory on the local drive. When the next job is started, dfget reads the meta information from this directory, avoiding accessing the managing node repeatedly.</p>\n<p>dfget always finds the most suitable assigned node to register. If fails, it requests other supernodes in order. If all fail, then it requests the managing node once again, updates the meta information, and repeats the above steps. If still fails, then the job fails.</p>\n<blockquote>\n<p>Note: If the dfclient.log suggests that the supernode registration fails all the time, try delete all files from the meta directory and try again.</p>\n</blockquote>\n<h2>What is temp directory of dfget and dfdaemon</h2>\n<p>The default temp data directory of <code>dfget</code> is <code>$HOME/.small-dragonfly/data</code> which cannot be configured at present.</p>\n<p>The default temp data directory of <code>dfdaemon</code> is <code>$HOME/.small-dragonfly/dfdaemon/data</code> which can be configured by flag <code>--localrepo</code>.</p>\n<p>When <code>dfdaemon</code> downloads images by <code>dfget</code>, it will set the target file path of <code>dfget</code> which  is <code>the temp data directory of dfdaemon</code>. So <code>dfget</code> will download the file to <code>$HOME/.small-dragonfly/data</code> and move to <code>$HOME/.small-dragonfly/dfdaemon/data</code> after downloaded totally.</p>\n<h2>How to clean up the data directory of Dragonfly</h2>\n<p>Normally, Dragonfly automatically cleans up files which are not accessed in three minutes from the uploading file list, and the residual files that live longer than one hour from the data directory.</p>\n<p>Follow these steps to clean up the data directory manually:</p>\n<ul>\n<li>Identify the account to which the residual files belong.</li>\n<li>Check if there is any running dfget process started by other accounts.</li>\n<li>If there is such a process, then terminate the process, and start a dfget process with the account identified at Step 1. This process will automatically clean up the residual files from the data directory.</li>\n</ul>\n<h2>Does Dragonfly support pulling images from an HTTPS enabled registry</h2>\n<p>Currently, Dragonfly <strong>DOES NOT</strong> support pulling images from an HTTPS enabled registry.</p>\n<p><code>dfdaemon</code> is a proxy between container engine and registry. It captures every request sent from container engine to registry, filters out all the image layer downloading requests and uses <code>dfget</code> to download them.</p>\n<p>We should investigate HTTPS proxy implementation and make it possible for dfdaemon to get HTTP data from tcp data, analysis them and download image layers correctly.</p>\n<p>We are planning to support this feature in Dragonfly 0.5.0.</p>\n<h2>Does Dragonfly support pulling an private image which needs username/password authentication</h2>\n<p>Yes, Dragonfly supports users to pull private image which needs username/password authentication. For example, when user wishes to pull private images from docker registries(such as Docker Hub <a href=\"https://index.docker.io/v1/\">https://index.docker.io/v1/</a> ), add authentication info of the user for the private images in <code>/root/.docker/config.json</code>. The format of <code>config.json</code> after adding authentication will be like the following way:</p>\n<pre><code class=\"language-json\">{\n      <span class=\"hljs-attr\">\"auths\"</span>: {\n              <span class=\"hljs-attr\">\"https://index.docker.io/v1/\"</span>: {\n                      <span class=\"hljs-attr\">\"auth\"</span>: <span class=\"hljs-string\">\"${auth_value}\"</span>\n              }\n      }\n}\n</code></pre>\n<p>In the above content the <code>auth_value</code> base64(&quot;<span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><mrow><mi>u</mi><mi>s</mi><mi>e</mi><mi>n</mi><mi>a</mi><mi>m</mi><mi>e</mi></mrow><mo>:</mo></mrow><annotation encoding=\"application/x-tex\">{usename}:</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"strut\" style=\"height:0.43056em;\"></span><span class=\"strut bottom\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"base textstyle uncramped\"><span class=\"mord textstyle uncramped\"><span class=\"mord mathit\">u</span><span class=\"mord mathit\">s</span><span class=\"mord mathit\">e</span><span class=\"mord mathit\">n</span><span class=\"mord mathit\">a</span><span class=\"mord mathit\">m</span><span class=\"mord mathit\">e</span></span><span class=\"mrel\">:</span></span></span></span>{password}&quot;). Since users definitely have their own username/password for private images, then use the following command to generate <code>$auth_value</code> and fill the generated result in <code>config.json</code>:</p>\n<pre><code class=\"language-shell\">echo \"${usename}:${password}\" | base64\n</code></pre>\n<h2>How to check if block piece is distributed among dfgets nodes</h2>\n<p>Supernode and dfget nodes together build a peer-to-peer network. The running log of dfget will explicitly show where the received block piece is from, supernode or other dfget node.</p>\n<p>User can get dfget's log from file <code>$HOME/.small-dragonfly/logs/dfclient.log</code>, and search the keyword <code>downloading piece</code>. If the prefix of field <code>dstCid</code> is <code>cdnnode</code>, then this piece block is from supernode, otherwise it is from dfget node.</p>\n<pre><code>## download from supernode\n2019-02-13 15:20:45.757 INFO sign:31923-1550042443.708 : downloading piece:{&quot;taskID&quot;:&quot;b4b0f175f7aef583ff6ff8da6b00024d7772b165caa66ff8ef3a9dce6701b690&quot;,&quot;superNode&quot;:&quot;127.0.0.1&quot;,&quot;dstCid&quot;:&quot;cdnnode:127.0.0.1~b4b0f175f7aef583ff6ff8da6b00024d7772b165caa66ff8ef3a9dce6701b690&quot;,&quot;range&quot;:&quot;0-4194303&quot;,&quot;result&quot;:503,&quot;status&quot;:701,&quot;pieceSize&quot;:4194304,&quot;pieceNum&quot;:0}\n\n# download from other dfget peer\n2019-02-13 15:22:40.062 INFO sign:32047-1550042560.044 : downloading piece:{&quot;taskID&quot;:&quot;b4b0f175f7aef583ff6ff8da6b00024d7772b165caa66ff8ef3a9dce6701b690&quot;,&quot;superNode&quot;:&quot;127.0.0.1&quot;,&quot;dstCid&quot;:&quot;127.0.0.1-31923-1550042443.708&quot;,&quot;range&quot;:&quot;0-4194303&quot;,&quot;result&quot;:503,&quot;status&quot;:701,&quot;pieceSize&quot;:4194304,&quot;pieceNum&quot;:0}\n</code></pre>\n<h2>How to view all the dfget logs of a task</h2>\n<p>You can follow the steps:</p>\n<ul>\n<li>\n<p>find a failed task: <code>grep 'download FAIL' dfclient.log</code>, such as:</p>\n<pre><code>2019-05-22 05:40:58.120 INFO sign:38923-1558496382.915 : download FAIL cost:75.208s length:4120442 reason:0\n</code></pre>\n</li>\n<li>\n<p>get all the logs of this task through the sign <code>38923-1558496382.915</code>: <code>grep 38923-1558496382.915 dfclient.log</code>, such as:</p>\n<pre><code>2019-05-22 05:39:42.919 INFO sign:38923-1558496382.915 : get cmd params:[&quot;dfget&quot; &quot;-u&quot; &quot;https://xxx&quot; &quot;-o&quot; &quot;./a.test&quot;]\n...\n...\n2019-05-22 05:40:58.120 INFO sign:38923-1558496382.915 : download FAIL cost:75.208s length:4120442 reason:0\n</code></pre>\n</li>\n</ul>\n<h2>Can I use self-specified ports for dragonfly</h2>\n<p>Announce the results firstly, and it is yes.</p>\n<p>Here are the port list that dragonfly will use:</p>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Default Value</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>dfdaemon proxy server port</td>\n<td>65001</td>\n<td>The port that dfdaemon proxy will listen.</td>\n</tr>\n<tr>\n<td>dfget uploader server port</td>\n<td>Random</td>\n<td>The port that the dfget uploader server will listen.</td>\n</tr>\n<tr>\n<td>supernode register port</td>\n<td>8002</td>\n<td>It's used for clients to register themselves as peers of p2p-network into supernode.</td>\n</tr>\n<tr>\n<td>supernode cdn file server port</td>\n<td>8001</td>\n<td>It's used for clients to download file pieces from supernode.</td>\n</tr>\n</tbody>\n</table>\n<p>And each item in the above table can be self-defined.</p>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Flag</th>\n<th>Remark</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>dfdaemon proxy server port</td>\n<td>dfdaemon --port</td>\n<td>The port should   be in the range of 2000-65535.</td>\n</tr>\n<tr>\n<td>dfget uploader server port</td>\n<td>dfget server --port</td>\n<td>You can use command <code>dfget server</code> to start a uploader server before using dfget to download if you don't want to use a random port.</td>\n</tr>\n<tr>\n<td>supernode register port</td>\n<td>supernode --port</td>\n<td>You can use <code>dfget --node IP:port</code> to register with the specified supernode register port.</td>\n</tr>\n<tr>\n<td>supernode cdn file server port</td>\n<td>supernode --download-port</td>\n<td>You should prepare a file server firstly and listen on the port that flag <code>download-port</code> will use.</td>\n</tr>\n</tbody>\n</table>\n<p><strong>NOTE</strong>: The supernode maintains both Java and Golang versions currently. And the above table is for the Golang version. And you will get a guide <a href=\"https://d7y.io/en-us/docs/userguide/supernode_configuration.html\">here</a> for Java version.</p>\n",
  "link": "/en-us/docs/faq.html",
  "meta": {}
}